// Домашняя Работа.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "Russian");
    cout <<   "\n   Задание 1\n" << endl;
    cout << "   ----------------------------- " << endl;
    cout << "  | 10:35:52                    |" << endl;
    cout << "  |                             |" << endl;
    cout << "  | четверг, 21 апреля          |" << endl;
    cout << "  |-----------------------------|" << endl;
    cout << "  | апрель 2022 г.              |" << endl;
    cout << "  |  пн  вт  ср  чт  пт  сб  вс |" << endl;
    cout << "  |  28  29  30  31   1   2   3 |" << endl;
    cout << "  |  4    5   6   7   8   9  10 |" << endl;
    cout << "  |  11  12  13  14  15  16  17 |" << endl;
    cout << "  |  18  19  20  21  22  23  24 |" << endl;
    cout << "  |  25  26  27  28  29  30   1 |" << endl;
    cout << "  |   2   3   4   5   6   7   8 |" << endl;
    cout << "   ----------------------------- \n" << endl;
    cout <<  "\n   Задание 2\n" << endl;
    cout <<"                   Энли Младший (То есть, я)                   "<< endl;
    cout <<"                           /      \\                           "<< endl;
    cout <<"                          /        \\\                         "<< endl;
    cout <<"                         /          \\\                        "<< endl;
    cout <<"             Энли Старший            Энли Старшая              "<< endl;
    cout <<"                 / \\                   /\\                    "<< endl;
    cout <<"                /   \\                 /  \\                   "<< endl;
    cout <<"               /     \\               /    \\                  "<< endl;
    cout <<"       Энли 1-ая  Энли 2-ая   Святой Энли  Святая Энли         \n"<< endl;
    cout <<"\n   Задание 3\n" << endl;

    cout <<"                                                                                                                         "<< endl;
    cout <<"            ****      **      **        **********    **        **                                                       "<< endl;
    cout <<"         *********    **      **       ************   **       ***                                                       "<< endl;
    cout <<"                 **   **      **       **        **   **      ****                                                       "<< endl;
    cout <<"         **********   **********       **        **   **   **   **                                                       "<< endl;
    cout <<"         **********   **********       **        **   ** **     **                                                       "<< endl;
    cout <<"                 **   **      **      **         **   ****      **                                                       "<< endl;                                                                                                                      "<< endl;
    cout <<"         ********     **      **     **          **   ***       **                                                       "<< endl;
    cout <<"            ****      **      **   **            **   **        **                                                       "<< endl;
 

   
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
